#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 Success! The configuration is valid.


#### Terraform Plan 📖 `success`

<details open><summary>Show Plan</summary>

```hcl
terraform
spectrocloud_cloudaccount_aws.this["account-aws-1"]: Refreshing state... [id=60b9150ce937eaa26f213e0f]
spectrocloud_cluster_profile.this: Refreshing state... [id=60b90d90e937ea9f1fc22595]
spectrocloud_cluster_eks.this["cluster-eks-dev-1"]: Refreshing state... [id=60b9150ce937eaa273dd1d47]
spectrocloud_cluster_eks.this["cluster-eks-dev-2"]: Refreshing state... [id=60b93614e937eaafca6339ce]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # spectrocloud_cluster_eks.this["cluster-eks-dev-2"] has been changed
  ~ resource "spectrocloud_cluster_eks" "this" {
        id               = "60b93614e937eaafca6339ce"
        name             = "eks-dev-2"
        # (3 unchanged attributes hidden)

      ~ cloud_config {
          + public_access_cidrs = []
            # (5 unchanged attributes hidden)
        }



        # (3 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # spectrocloud_cluster_eks.this["cluster-eks-dev-2"] will be updated in-place
  ~ resource "spectrocloud_cluster_eks" "this" {
        id               = "60b93614e937eaafca6339ce"
        name             = "eks-dev-2"
        # (3 unchanged attributes hidden)


      ~ cluster_profile {
            id = "60b90d90e937ea9f1fc22595"

          ~ pack {
                name   = "spectro-rbac"
              ~ values = <<-EOT
                    charts:
                      spectro-rbac:
                        clusterRoleBindings:
                        - role: "view"
                          subjects:
                          - name: "user6"
                            type: "User"
                          - name: "group6"
                            type: "Group"
                  +       - name: "group7"
                  +         type: "Group"
                          - name: "group6"
                            namespace: "foo"
                            type: "ServiceAccount"
                        namespaces:
                        - createNamespace: true
                          namespace: "team2"
                          roleBindings:
                          - kind: "ClusterRole"
                            role: "admin"
                            subjects:
                            - name: "team-vendor-b"
                              type: "Group"
                        
                EOT
                # (1 unchanged attribute hidden)
            }
        }


      + machine_pool {
          + az_subnets    = {
              + "us-west-2a" = "subnet-07f0af093b8233990"
              + "us-west-2b" = "subnet-0e0d96dc7ad3f02a5"
              + "us-west-2c" = "subnet-09e74165071ce03e6"
            }
          + azs           = []
          + count         = 1
          + disk_size_gb  = 61
          + instance_type = "t3.large"
          + name          = "worker-basic2"
        }
        # (3 unchanged blocks hidden)
    }

  # spectrocloud_cluster_eks.this["cluster-eks-dev-3"] will be created
  + resource "spectrocloud_cluster_eks" "this" {
      + cloud_account_id = "60b9150ce937eaa26f213e0f"
      + cloud_config_id  = (known after apply)
      + id               = (known after apply)
      + kubeconfig       = (known after apply)
      + name             = "eks-dev-2"

      + cloud_config {
          + az_subnets      = {
              + "us-west-2a" = "subnet-07f0af093b8233990,subnet-080b9dc42d15b57a2"
              + "us-west-2b" = "subnet-0e0d96dc7ad3f02a5,subnet-025428faaddc4201f"
              + "us-west-2c" = "subnet-09e74165071ce03e6,subnet-0964e92baa663e495"
            }
          + azs             = []
          + endpoint_access = "public"
          + region          = "us-east-1"
          + vpc_id          = "vpc-0c9679602584608f9"
        }

      + cluster_profile {
          + id = "60b90d90e937ea9f1fc22595"

          + pack {
              + name   = "spectro-rbac"
              + tag    = "1.0.0"
              + values = <<-EOT
                    charts:
                      spectro-rbac:
                        clusterRoleBindings:
                        - role: "view"
                          subjects:
                          - name: "user6"
                            type: "User"
                          - name: "group6"
                            type: "Group"
                          - name: "group6"
                            namespace: "foo"
                            type: "ServiceAccount"
                        namespaces:
                        - createNamespace: true
                          namespace: "team2"
                          roleBindings:
                          - kind: "ClusterRole"
                            role: "admin"
                            subjects:
                            - name: "team-vendor-b"
                              type: "Group"
                        
                EOT
            }
        }

      + fargate_profile {
          + additional_tags = {
              + "hello" = "test1"
            }
          + name            = "fg-1"
          + subnets         = [
              + "subnet-07f0af093b8233990",
              + "subnet-0e0d96dc7ad3f02a5",
              + "subnet-09e74165071ce03e6",
            ]

          + selector {
              + labels    = {
                  + "abc" = "cool"
                }
              + namespace = "fargate"
            }
        }

      + machine_pool {
          + az_subnets    = {
              + "us-west-2a" = "subnet-07f0af093b8233990"
              + "us-west-2b" = "subnet-0e0d96dc7ad3f02a5"
              + "us-west-2c" = "subnet-09e74165071ce03e6"
            }
          + azs           = []
          + count         = 3
          + disk_size_gb  = 61
          + instance_type = "t3.large"
          + name          = "worker-basic"
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @saamalik, Action: `pull_request`, Working Directory: `tf-scripts`, Workflow: `Terraform Plan`*